#include <stdio.h>


/*****************************
作者:刘光磊
联系方式:18601767221@163.com
创作日期:2017/8/14/15/11
程序说明:C语言嵌套汇编的案例
*****************************/
void use_asm() {

	int a, b, c = 0; //初始化声明三个整数变量并赋值为0

	a = 4; 
	b = 6;

	printf("before a=%d\tb=%d\tc=%d\n", a, b, c);

	_asm {
	
		//将变量a的值赋值给eax寄存器
		mov eax, a;
		//将变量b的值和寄存器eax相加
		add eax, b;
		//将相加的结果赋值给c
		mov c, eax;
	}

	printf("after  a=%d\tb=%d\tc=%d\n", a, b, c);


}

/*****************************
作者:刘光磊
联系方式:18601767221@163.com
创作日期:2017/8/14/15/10
程序说明:入口方法
*****************************/
void main0() {

	use_asm();
	getchar();

}